syllable
syllables
suffix
suffixes
prefix
prefixes
phonic
phonics
phonetic
phonetics
phonetical
phonetically
explain
explains
explanation
explanations
identify
identifies
support
supports
supporting
supported
character
characters
personality
personalities
setting
settings
plot
plots
selection
selections
passage
passages
compare
comparison
compares
compared
contrast
contrasts
contrasting
contrasted
diagram
diagrams
flier
fliers
advertise
advertises
advertisements
advertised
persuade
persuades
persuasive
persuasively
persuasion
inform
information
informative
informatively
informational
informs
informed
informing
conclusion
conclude
concludes
conclusions
concluding
phrase
phrases
cause
causes
causation
causal
causality
effect
effects
event
events
detail
details
describe
describes
description
characterize
characterization
likely
most likely
heading
headings
paragraph
paragraphs
poem
poems
poetry
poetic
article
articles
based
basis
word
words
root
roots
latin
message
messages
author
authors
purpose
purposes
answer
answers
answered
true
false
sentence
sentences
opinion
opinions
opinionated
fact
facts
factual
summary
summarize
summaries
summarizes
main
idea
ideas
main idea
main ideas
report
reports
reported
title
titles
titled
synonym
synonyms
antonym
antonyms
dictionary
dictionaries
thesaurus
thesauruses
opposite
opposites
meaning
mean
means
reader
readers
according
step
steps
sequence
sequences
chronology
chronological
chronologically
order
orders
ordered
ordering
structure
structures
structuring
define
defined
defines
definition
definitions
fiction
fictional
nonfiction
nonfictional
header
headers
statement
statements
dialogue
dialogues
infer
infers
inferring
inference
argument
argue
argues
arguing
vocab
vocabulary
vocabularies
literature
literary
device
devices
technique
techniques
detailed
detailing
specific
specifics
specify
specifically
specification
metaphor
metaphors
metaphorical
simile
similes
symbol
symbols
symbolism
symbolic
symbolically
personify
personification
personifies
idiom
idioms
idiomatic
idiomatically
hyperbole
hyperboles
figurative
figuratively
language
languages
topic
topics
claim
claims
claiming
evidence
evidences
reason
reasons
reasoning
problem
problems
solution
solutions
climax
climaxes
resolve
resolves
resolution
resolutions
narrative
narratives
narrator
narrators
list
listing
lists
listed
reveal
reveals
revealing
irony
ironic
ironically
situation
situations
situational
attitude
attitudes
confirm
confirms
confirming
confirmation
prove
proof
proving
proves
proven
audience
audiences
include
includes
inclusion
including
intend
intent
intention
intentional
intentions
intending
question
questions
questioning
suggest
suggests
suggesting
suggestion
suggestions
edit
edits
editing
revise
revises
revision
revisions
analogy
analogies
analogous
emphasis
emphasize
emphasizes
highlight
highlights
highlighted
underline
underlines
underlined
bold
bolded
bolding
illustrate
illustates
illustrated
illustration
image
images
picture
pictures
graph
graphs
photo
photos
photograph
photographs
develop
develops
developed
theme
themes
thesis
theses
introduce
introduces
introduced
concept
concepts
conceptual
conceptually
communicate
communicates
communicated
communication
humor
humorous
humorously
sarcasm
sarcastic
satire
satires
satirical
satirically
feeling
feelings
feels
felt
convey
conveys
conveying
emotion
emotions
emotional
emotionally
think
thinks
thinking
thought
sense
senses
meant
example
examples
exemplify
exemplifies
contain
contains
containing
contained
onomatopoeia
appear
appears
appearance
appearances
thoughts
action
actions
acts
acted
acting
described
chapter
chapters
excerpt
excerpts
excerpted
connotation
connotate
negative
negatively
positive
positively
connotations
denote
denotes
denoted
denotation
magazine
magazines
express
expresses
expressed
organizational
organize
organizes
organizationally
organized
future
futures
expository
expose
exposes
exposed
editorial
editorials
sensory
flashback
flashbacks
alliteration
alliterations
establish
establishes
establishment
establishing
conflict
conflicts
conflicting
conflicted
imagery
point view
perspective
perspectives
agree
agrees
disagree
disagrees
agreement
disagreement
entertain
entertains
entertaining
entertained
entertainment
relate
related
relation
relationship
relationships
relatable
show
shows
similarities
depict
depicts
depictions
depiction
obstacle
obstacles
source
sources
personal
personally
critique
critiques
criticism
conclusive
understand
understands
understanding
understood
stanza
stanzas
story
stories
history
historical
context
contexts
contextual
contextualize
contextualizes
contextualized
line
lines
lined
speaker
speakers
speaking
spoke
homophone
homophones
homonym
homonyms
because
happen
happens
happened
beginning
middle
after
ending
afterward
begin
began
begins
begun
discover
discovers
discovery
discovered
note
notes
noted
noting
tone
tones
different
difference
complete
same
identical
dictionary entry
dictionary entries
describing
common
entry
entries
presume
presumes
presumed
presumably
presuming
know
knows
knowing
revealed
want
wants
help
helps
helped
helping
discuss
discusses
discussing
repetition
repetitions
repeat
repeats
repeating
repeated
textbook
textbooks
adapt
adapted
adapting
adaptation
adapts
change
changes
changing
changed
mind
minds
experience
experiences
experiencing
experienced
