electromagnet
electromagnetic
electromagnetism
electricity
electrical
electrically
electricities
electromagnets
insulate
insulates
insulator
insulators
insulated
insulation
battery
batteries
wire
wires
charge
charges
charged
power
powerful
circuit
circuits
circuitry
electron
electrons
ions
charging
current
currents
volt
volts
voltage
watt
watts
wattage
resist
resists
resistance
conduct
conductor
conducts
conduction
conducting
conducted
semiconductor
semiconductors
semiconduct
capacitor
capacitors
transformer
transformers
transistor
transistors
static
statics
proton
protons
neutron
neutrons
element
elements
atom
atoms
atomic
atomically
table
tables
poison
poisonous
organism
organisms
organic
adapt
adaptation
adapts
adapted
adapting
relation
relationship
relationships
social
socially
hierarchy
hierarchical
water
waters
liquid
liquids
liquidity
solid
solids
solidly
coal
coals
energy
source
sources
resources
gases
gasses
cell
cells
cell wall
cell walls
membrane
membranes
organ
organs
organelle
organelles
substance
substances
substantial
solvent
solvents
solute
solutes
solution
solutions
dissolve
dissolved
light
lights
wave
waves
data
graph
graphs
graphed
mole
moles
molar
molarity
tide
tides
planet
planets
planetary
solar
label
labels
vertebrate
vertebrates
invertebrate
invertebrates
classify
class
classes
classification
animal
animals
animalia
structure
structures
sediment
sediments
mass
masses
sinkhole
sinkholes
formation
formations
form
forms
rock
rocks
volume
volumes
lysosome
lysosomes
sound
sounds
frequency
frequencies
plant
plants
compound
compounds
equation
equations
fossil
fossils
chart
charts
earth
earths
acid
acidic
food
foods
travel
travels
traveling
information
informs
statement
scientist
scientists
food web
food webs
food chain
food chains
hurricane
hurricanes
equator
degree
degrees
north
south
east
west
latitude
latitudes
longitude
longitudes
warm
deep
shallow
cold
cool
observe
observation
observes
qualitative
quantitative
island
diagram
diagrams
pattern
patterns
population
populations
ecosystem
ecosystems
community
communities
competition
competitions
symbiotic
symbiotically
heat
heating
heated
heat transfer
heat transfers
heat transferring
convection
trial
trials
hypothesis
hypothesize
hypothesizes
hypothesized
friction
distance
distances
laboratory
labs
laboratories
temperature
temperatures
line graph
line graphs
aquarium
aquariums
record
recorded
occluded front
occluded fronts
stationary front
stationary fronts
estuary
estuaries
ocean
oceans
lake
lakes
pond
ponds
fresh water
fresh waters
salt water
salt waters
saltwater
saltwaters
storm
storms
storming
weather
weathers
weathered
weathering
erosion
erode
erodes
eroded
eroding
kinetic
potential
thermal
thermally
convert
conversion
converting
converts
converted
motor
motors
range
ranges
independent
independently
dependent
dependently
numerical
numerically
number
numbers
numbering
investigate
investigates
investigation
investigations
investigating
observations
observing
procedure
procedures
mammal
mammals
experiment
experiments
saturn
jupiter
gravity
gravitational
beaker
beakers
base
basic
neutral
neutrality
soil
soils
silt
silts
sand
sands
clay
clays
bubble
bubbles
color
colors
work
worked
nuclear
nuclear energy
ozone
carbon dioxide
carbon
carbons
carbonate
fossil fuel
fossil fuels
fuel
fuels
waste
wastes
cloud
clouds
vapor
vaporize
vaporizes
condense
condensed
condenses
condensation
condensing
evaporate
evaporated
evaporates
evaporation
evaporating
precipitate
precipitation
precipitating
precipitated
rain
raining
rained
rains
snow
snows
snowing
snowed
cycle
cycles
universal solvent
insect
insects
genetic
genetics
predator
predators
prey
species
family
families
bugs
arachnid
arachnids
genetic engineering
engineer
engineers
engineering
engineered
resistant
nonrenewable
nonrenewables
renewable
renewables
recycle
recycles
recycled
recycling
paper
papers
tree
trees
lighting
vacuum
vacuums
scientific notation
speed light
speed
property
properties
boil
boils
boiled
boiling
chemical
chemicals
oxygen
density
dense
denser
unknown
system
systems
tissue
tissues
biological
biology
resistor
resistors
generator
generators
voltmeter
voltmeters
heater
heaters
device
devices
birth
food source
herbivore
herbivorous
herbivores
carnivore
carnivorous
carnivores
omnivore
omnivorous
omnivores
evolve
evolves
evolution
natural selection
naturally select
naturally selected
naturally selects
compete
competes
competitors
parasite
parasites
parasitism
mutualism
commensalism
condition
conditions
pollinate
pollinator
pollinators
grow
grows
growth
growing
increase
increases
increased
decrease
decreases
decreased
constant
constants
control
controls
thrive
thrives
thriving
survive
survives
survival
characteristic
characteristics
environment
environments
decibel
decibels
radiate
radiation
radiated
radiates
droplet
droplets
freeze
freezes
freezing
frozen
photosynthesis
photosynthesize
photosynthesizes
photosynthesized
photosynthetic
nutrient
nutrients
nutrition
fish
rainfall
rainfalls
annual
annually
total
totals
biotic
abiotic
biosphere
biospheres
reaction
reactions
physical
physically
mineral
minerals
minerally
limestone
limestones
moss
mosses
lichen
surface
surfaces
react
reacts
reacting
reacted
periodic table
period
column
group
groups
grouping
groupings
grouped
columns
periods
genus
influence
influenced
influences
influencing
time
times
climate
climates
colder
vacuole
vacuoles
ribosome
ribosomes
chromosome
chromosomes
fertilize
fertilizer
fertilizers
fertilization
fertilizations
sperm
sperms
gene
genes
offspring
young
ancestor
ancestors
structural
structurally
parent
parents
punnett
burn
burns
burning
burned
wind
winds
windy
turbine
turbines
farm
farms
farmer
farmers
farming
farmed
agriculture
agricultural
agriculturally
sunlight
sunlit
dams
power station
source energy
amplitude
amplitudes
wavelength
wavelengths
inverse
inverses
inversely
relate
related
over time
interact
interacting
interacts
interaction
interactions
picture
pictures
photo
photos
photographs
consume
consumes
eats
alert
alerts
benefit
benefits
beneficial
benefited
coil
magnetic field
magnetic fields
strong
strength
strengthen
iron nail
trait
traits
genotype
genotypes
genotypical
phenotypical
phenotype
phenotypes
helix
mesosphere
mesopheric
thermosphere
thermospheric
stratosphere
stratospheric
troposphere
tropospheric
atmosphere
atmospheric
pressure
pressures
altitude
altitudes
producer
producers
consumer
consumers
decompose
decomposes
decomposer
decomposers
produce
produced
production
metric
celsius
fahrenheit
fall
falls
falling
accelerate
accelerates
acceleration
force
forces
forcing
exert
exerted
exertion
newton
motion
move
moves
movement
moving
solar system
revolution
revolutions
revolve
revolves
gaseous
composition
rotate
rotates
rotation
rotations
rotating
mitochondria
compare
compares
comparing
comparison
comparisons
chloroplast
chloroplasts
measure
measures
measurement
measuring
measured
equipment
rate
rates
nucleus
nuclei
kingdom
kingdoms
domain
domains
cellular
respiration
respire
respiring
respires
unicellular
multicellular
autotroph
autotrophs
autotrophic
heterotroph
heterotrophs
heterotrophic
quality
qualities
carpool
carpooling
compost
composted
error
errors
percent
percents
percentage
percentages
associate
associates
associated
association
associative
measurements
estimate
estimates
estimation
estimated
estimating
exothermic
endothermic
probe
probes
type
types
synthesis
neutralize
neutralization
oxidation
oxidize
oxidizes
oxidation-reduction
double-replacement
reduction
cation
cations
anion
anions
oxide
vaporized
ethanol
approximate
approximately
aqueous
significant figure
significant figures
significant digit
significant digits
decomposition
decomposed
single-replacement
formula
formulas
ionic
technique
techniques
chromatography
titrate
titration
titrated
titrates
filter
filters
filtering
contaminate
contamination
contaminates
contaminated
contaminating
electronegative
electronegativity
particle
particles
particulate
particulates
value
values
equilibrium
partial pressure
partial pressures
joule
joules
specific heat
specific heats
capacity
capacities
covalent
covalency
bond
bonds
bonded
bonding
molecule
molecules
molecular
molecularly
intermolecular
cathode
gamma rays
gamma ray
rays
xray
xrays
stoichiometric
stiochiometry
reactant
reactants
product
products
quantity
quantities
catalyst
catalysts
enzyme
enzymes
attract
repel
repels
repeling
attraction
attracted
attracting
attracts
melt
melts
melting
melted
precise
precisely
precision
accurate
accurately
accuracy
empirical
empirically
polar
polarity
nonpolar
nonpolarity
collect
collects
collecting
collected
collection
electrolyte
electrolytes
electrolysis
half-life
decay
decays
decaying
dominant
recessive
heterozygous
homozygous
mitosis
meiosis
interphase
prophase
metaphase
anaphase
telophase
eukaryotic
eukaryote
eukaryotes
diet
niche
niches
reproductive
reproduce
reproduces
reproduction
sexual
sexually
asexual
asexually
curve
curves
curving
increasing
decreasing
theory
theories
flagellum
flagelli
darwin
concept
concepts
behavioral
isotope
isotopes
effect
effects
germ
germs
antibiotic
antibiotics
biologist
biologists
chemist
chemists
macromolecule
macromolecules
fungi
fungus
fungal
bacteria
bacterial
plantae
concluded
conclusion
concludes
infer
inference